---
kind: method
id: M:Autodesk.Revit.DB.UV.GetLength
source: html/21d3cb19-a748-c390-b387-1f3f502c4cdf.htm
---
# Autodesk.Revit.DB.UV.GetLength Method

The length of this 2-D vector.

## Syntax (C#)
```csharp
public double GetLength()
```

## Remarks
In 2-D Euclidean space, the length of the vector is the square root of the sum
of the two coordinates squared.